#### Terraform Apply Results 🌟
Preview environment has been deployed. You can now test your changes.

<details><summary>Show Actual Apply</summary>

```

[0m[1mmodule.get_webhook_lambda.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.get_webhook_lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.get_webhook_lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.save_webhook_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.list_webhooks_lambda.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.get_webhook_lambda.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.get_webhook_lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.save_webhook_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.trigger_webhook_lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.get_webhook_docker_image.data.aws_caller_identity.this: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.this: Reading...[0m[0m
[0m[1mmodule.save_webhook_lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mdata.aws_acm_certificate.issued: Reading...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.save_webhook_lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.save_webhook_lambda.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.save_webhook_docker_image.data.aws_caller_identity.this: Reading...[0m[0m
[0m[1mmodule.list_webhooks_docker_image.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.get_webhook_docker_image.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.get_webhook_docker_image.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.list_webhooks_docker_image.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mdata.aws_ecr_authorization_token.token: Reading...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.get_webhook_lambda.data.aws_caller_identity.current: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.get_webhook_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.get_webhook_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.list_webhooks_docker_image.data.aws_caller_identity.this: Reading...[0m[0m
[0m[1mmodule.list_webhooks_lambda.data.aws_caller_identity.current: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.save_webhook_docker_image.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.save_webhook_docker_image.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mdata.aws_route53_zone.awseducate_systems: Reading...[0m[0m
[0m[1mmodule.get_webhook_docker_image.data.aws_caller_identity.this: Read complete after 0s [id=070576557102][0m
[0m[1mdata.aws_ssm_parameter.lambda_authorizer_lambda_invoke_arn: Reading...[0m[0m
[0m[1mmodule.list_webhooks_lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.list_webhooks_lambda.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.trigger_webhook_lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.trigger_webhook_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.trigger_webhook_docker_image.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.trigger_webhook_docker_image.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.save_webhook_lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.save_webhook_lambda.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.list_webhooks_lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.list_webhooks_lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.list_webhooks_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.list_webhooks_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.trigger_webhook_docker_image.data.aws_caller_identity.this: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.this: Read complete after 0s [id=070576557102][0m
[0m[1mdata.aws_route53_zone.awseducate_systems: Read complete after 0s [id=Z07640481V8AX0BY9VGXY][0m
[0m[1mmodule.save_webhook_docker_image.data.aws_caller_identity.this: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.save_webhook_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...[0m[0m
[0m[1mmodule.list_webhooks_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...[0m[0m
[0m[1mmodule.get_webhook_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...[0m[0m
[0m[1mmodule.save_webhook_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2935705900][0m
[0m[1mmodule.get_webhook_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1884747089][0m
[0m[1mmodule.list_webhooks_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1675980549][0m
[0m[1mmodule.save_webhook_lambda.data.aws_caller_identity.current: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.trigger_webhook_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3990678865][0m
[0m[1mdata.aws_ecr_authorization_token.token: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.trigger_webhook_lambda.data.aws_caller_identity.current: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.list_webhooks_docker_image.data.aws_caller_identity.this: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.trigger_webhook_docker_image.data.aws_caller_identity.this: Read complete after 0s [id=070576557102][0m
[0m[1mdata.aws_ssm_parameter.lambda_authorizer_lambda_invoke_arn: Read complete after 1s [id=preview-lambda_authorizer_lambda_invoke_arn][0m
[0m[1mdata.aws_acm_certificate.issued: Read complete after 1s [id=arn:aws:acm:us-west-1:070576557102:certificate/d5718528-3613-4faf-94d0-b6ca9825ff3f][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # aws_dynamodb_table.webhook[0m will be created
[0m  [32m+[0m[0m resource "aws_dynamodb_table" "webhook" {
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m billing_mode                = "PAY_PER_REQUEST"
      [32m+[0m[0m deletion_protection_enabled = false
      [32m+[0m[0m hash_key                    = "webhook_id"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m name                        = "webhook"
      [32m+[0m[0m read_capacity               = (known after apply)
      [32m+[0m[0m stream_arn                  = (known after apply)
      [32m+[0m[0m stream_label                = (known after apply)
      [32m+[0m[0m stream_view_type            = (known after apply)
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Name" = "webhook"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Name"        = "webhook"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m write_capacity              = (known after apply)

      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "sequence_number"
          [32m+[0m[0m type = "N"
        }
      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "webhook_id"
          [32m+[0m[0m type = "S"
        }
      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "webhook_type"
          [32m+[0m[0m type = "S"
        }

      [32m+[0m[0m global_secondary_index {
          [32m+[0m[0m hash_key           = "webhook_type"
          [32m+[0m[0m name               = "webhook-webhook_type-sequence_number-gsi"
          [32m+[0m[0m non_key_attributes = []
          [32m+[0m[0m projection_type    = "ALL"
          [32m+[0m[0m range_key          = "sequence_number"
        }

      [32m+[0m[0m point_in_time_recovery {
          [32m+[0m[0m enabled = false
        }

      [32m+[0m[0m server_side_encryption (known after apply)

      [32m+[0m[0m ttl (known after apply)
    }

[1m  # aws_dynamodb_table.webhook_total_count[0m will be created
[0m  [32m+[0m[0m resource "aws_dynamodb_table" "webhook_total_count" {
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m billing_mode                = "PAY_PER_REQUEST"
      [32m+[0m[0m deletion_protection_enabled = false
      [32m+[0m[0m hash_key                    = "webhook_type"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m name                        = "webhook_total_count"
      [32m+[0m[0m read_capacity               = (known after apply)
      [32m+[0m[0m stream_arn                  = (known after apply)
      [32m+[0m[0m stream_label                = (known after apply)
      [32m+[0m[0m stream_view_type            = (known after apply)
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Name" = "webhook"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Name"        = "webhook"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m write_capacity              = (known after apply)

      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "webhook_type"
          [32m+[0m[0m type = "S"
        }

      [32m+[0m[0m point_in_time_recovery {
          [32m+[0m[0m enabled = false
        }

      [32m+[0m[0m server_side_encryption (known after apply)

      [32m+[0m[0m ttl (known after apply)
    }

[1m  # aws_route53_record.api_gateway_custom_domain_record[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "api_gateway_custom_domain_record" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "preview-webhook-service-internal-api-tpet.aws-educate.tw"
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z07640481V8AX0BY9VGXY"

      [32m+[0m[0m alias {
          [32m+[0m[0m evaluate_target_health = false
          [32m+[0m[0m name                   = (known after apply)
          [32m+[0m[0m zone_id                = (known after apply)
        }
    }

[1m  # random_string.this[0m will be created
[0m  [32m+[0m[0m resource "random_string" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 4
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.api_gateway.aws_apigatewayv2_api.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_api" "this" {
      [32m+[0m[0m api_endpoint                 = (known after apply)
      [32m+[0m[0m api_key_selection_expression = "$request.header.x-api-key"
      [32m+[0m[0m arn                          = (known after apply)
      [32m+[0m[0m description                  = "File service api gateway to lambda container image"
      [32m+[0m[0m disable_execute_api_endpoint = true
      [32m+[0m[0m execution_arn                = (known after apply)
      [32m+[0m[0m fail_on_warnings             = false
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m name                         = "preview-webhook_service"
      [32m+[0m[0m protocol_type                = "HTTP"
      [32m+[0m[0m route_selection_expression   = "$request.method $request.path"
      [32m+[0m[0m tags                         = {
          [32m+[0m[0m "Service"               = "webhook_service"
          [32m+[0m[0m "terraform-aws-modules" = "apigateway-v2"
        }
      [32m+[0m[0m tags_all                     = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Project"               = "AWS Educate TPET"
          [32m+[0m[0m "Service"               = "webhook_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "apigateway-v2"
        }

      [32m+[0m[0m cors_configuration {
          [32m+[0m[0m allow_credentials = true
          [32m+[0m[0m allow_headers     = [
              [32m+[0m[0m "authorization",
              [32m+[0m[0m "content-type",
              [32m+[0m[0m "x-amz-date",
              [32m+[0m[0m "x-amz-security-token",
              [32m+[0m[0m "x-amz-user-agent",
              [32m+[0m[0m "x-api-key",
            ]
          [32m+[0m[0m allow_methods     = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m allow_origins     = [
              [32m+[0m[0m "http://localhost:3000",
              [32m+[0m[0m "http://localhost:5500",
              [32m+[0m[0m "https://*",
            ]
        }
    }

[1m  # module.api_gateway.aws_apigatewayv2_api_mapping.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_api_mapping" "this" {
      [32m+[0m[0m api_id          = (known after apply)
      [32m+[0m[0m api_mapping_key = "preview"
      [32m+[0m[0m domain_name     = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m stage           = (known after apply)
    }

[1m  # module.api_gateway.aws_apigatewayv2_authorizer.this["lambda_authorizer"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_authorizer" "this" {
      [32m+[0m[0m api_id                            = (known after apply)
      [32m+[0m[0m authorizer_payload_format_version = "2.0"
      [32m+[0m[0m authorizer_result_ttl_in_seconds  = (known after apply)
      [32m+[0m[0m authorizer_type                   = "REQUEST"
      [32m+[0m[0m authorizer_uri                    = (sensitive value)
      [32m+[0m[0m enable_simple_responses           = true
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m name                              = "lambda_authorizer"
    }

[1m  # module.api_gateway.aws_apigatewayv2_domain_name.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_domain_name" "this" {
      [32m+[0m[0m api_mapping_selection_expression = (known after apply)
      [32m+[0m[0m arn                              = (known after apply)
      [32m+[0m[0m domain_name                      = "preview-webhook-service-internal-api-tpet.aws-educate.tw"
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m tags                             = {
          [32m+[0m[0m "Service" = "webhook_service"
        }
      [32m+[0m[0m tags_all                         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m domain_name_configuration {
          [32m+[0m[0m certificate_arn                        = "arn:aws:acm:us-west-1:070576557102:certificate/d5718528-3613-4faf-94d0-b6ca9825ff3f"
          [32m+[0m[0m endpoint_type                          = "REGIONAL"
          [32m+[0m[0m hosted_zone_id                         = (known after apply)
          [32m+[0m[0m ownership_verification_certificate_arn = (known after apply)
          [32m+[0m[0m security_policy                        = "TLS_1_2"
          [32m+[0m[0m target_domain_name                     = (known after apply)
        }
    }

[1m  # module.api_gateway.aws_apigatewayv2_integration.this["GET /webhooks"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_integration" "this" {
      [32m+[0m[0m api_id                                    = (known after apply)
      [32m+[0m[0m connection_type                           = "INTERNET"
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m integration_response_selection_expression = (known after apply)
      [32m+[0m[0m integration_type                          = "AWS_PROXY"
      [32m+[0m[0m integration_uri                           = (known after apply)
      [32m+[0m[0m payload_format_version                    = "1.0"
      [32m+[0m[0m timeout_milliseconds                      = 29000
    }

[1m  # module.api_gateway.aws_apigatewayv2_integration.this["GET /webhooks/{webhook_id}"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_integration" "this" {
      [32m+[0m[0m api_id                                    = (known after apply)
      [32m+[0m[0m connection_type                           = "INTERNET"
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m integration_response_selection_expression = (known after apply)
      [32m+[0m[0m integration_type                          = "AWS_PROXY"
      [32m+[0m[0m integration_uri                           = (known after apply)
      [32m+[0m[0m payload_format_version                    = "1.0"
      [32m+[0m[0m timeout_milliseconds                      = 29000
    }

[1m  # module.api_gateway.aws_apigatewayv2_integration.this["POST /trigger-webhook/{webhook_id}"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_integration" "this" {
      [32m+[0m[0m api_id                                    = (known after apply)
      [32m+[0m[0m connection_type                           = "INTERNET"
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m integration_response_selection_expression = (known after apply)
      [32m+[0m[0m integration_type                          = "AWS_PROXY"
      [32m+[0m[0m integration_uri                           = (known after apply)
      [32m+[0m[0m payload_format_version                    = "1.0"
      [32m+[0m[0m timeout_milliseconds                      = 29000
    }

[1m  # module.api_gateway.aws_apigatewayv2_integration.this["POST /webhook"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_integration" "this" {
      [32m+[0m[0m api_id                                    = (known after apply)
      [32m+[0m[0m connection_type                           = "INTERNET"
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m integration_response_selection_expression = (known after apply)
      [32m+[0m[0m integration_type                          = "AWS_PROXY"
      [32m+[0m[0m integration_uri                           = (known after apply)
      [32m+[0m[0m payload_format_version                    = "1.0"
      [32m+[0m[0m timeout_milliseconds                      = 29000
    }

[1m  # module.api_gateway.aws_apigatewayv2_route.this["GET /webhooks"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_route" "this" {
      [32m+[0m[0m api_id             = (known after apply)
      [32m+[0m[0m api_key_required   = false
      [32m+[0m[0m authorization_type = "CUSTOM"
      [32m+[0m[0m authorizer_id      = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m route_key          = "GET /webhooks"
      [32m+[0m[0m target             = (known after apply)
    }

[1m  # module.api_gateway.aws_apigatewayv2_route.this["GET /webhooks/{webhook_id}"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_route" "this" {
      [32m+[0m[0m api_id             = (known after apply)
      [32m+[0m[0m api_key_required   = false
      [32m+[0m[0m authorization_type = "CUSTOM"
      [32m+[0m[0m authorizer_id      = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m route_key          = "GET /webhooks/{webhook_id}"
      [32m+[0m[0m target             = (known after apply)
    }

[1m  # module.api_gateway.aws_apigatewayv2_route.this["POST /trigger-webhook/{webhook_id}"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_route" "this" {
      [32m+[0m[0m api_id             = (known after apply)
      [32m+[0m[0m api_key_required   = false
      [32m+[0m[0m authorization_type = "NONE"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m route_key          = "POST /trigger-webhook/{webhook_id}"
      [32m+[0m[0m target             = (known after apply)
    }

[1m  # module.api_gateway.aws_apigatewayv2_route.this["POST /webhook"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_route" "this" {
      [32m+[0m[0m api_id             = (known after apply)
      [32m+[0m[0m api_key_required   = false
      [32m+[0m[0m authorization_type = "CUSTOM"
      [32m+[0m[0m authorizer_id      = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m route_key          = "POST /webhook"
      [32m+[0m[0m target             = (known after apply)
    }

[1m  # module.api_gateway.aws_apigatewayv2_stage.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_stage" "this" {
      [32m+[0m[0m api_id        = (known after apply)
      [32m+[0m[0m arn           = (known after apply)
      [32m+[0m[0m auto_deploy   = true
      [32m+[0m[0m deployment_id = (known after apply)
      [32m+[0m[0m execution_arn = (known after apply)
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m invoke_url    = (known after apply)
      [32m+[0m[0m name          = "preview"
      [32m+[0m[0m tags          = {
          [32m+[0m[0m "Service" = "webhook_service"
        }
      [32m+[0m[0m tags_all      = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m access_log_settings {
          [32m+[0m[0m destination_arn = (known after apply)
          [32m+[0m[0m format          = jsonencode(
                {
                  [32m+[0m[0m context = {
                      [32m+[0m[0m domainName              = "$context.domainName"
                      [32m+[0m[0m error                   = {
                          [32m+[0m[0m message      = "$context.error.message"
                          [32m+[0m[0m responseType = "$context.error.responseType"
                        }
                      [32m+[0m[0m identity                = {
                          [32m+[0m[0m sourceIP = "$context.identity.sourceIp"
                        }
                      [32m+[0m[0m integration             = {
                          [32m+[0m[0m error             = "$context.integration.error"
                          [32m+[0m[0m integrationStatus = "$context.integration.integrationStatus"
                        }
                      [32m+[0m[0m integrationErrorMessage = "$context.integrationErrorMessage"
                      [32m+[0m[0m protocol                = "$context.protocol"
                      [32m+[0m[0m requestId               = "$context.requestId"
                      [32m+[0m[0m requestTime             = "$context.requestTime"
                      [32m+[0m[0m responseLength          = "$context.responseLength"
                      [32m+[0m[0m routeKey                = "$context.routeKey"
                      [32m+[0m[0m stage                   = "$context.stage"
                      [32m+[0m[0m status                  = "$context.status"
                    }
                }
            )
        }

      [32m+[0m[0m default_route_settings {
          [32m+[0m[0m data_trace_enabled       = false
          [32m+[0m[0m detailed_metrics_enabled = true
          [32m+[0m[0m logging_level            = (known after apply)
          [32m+[0m[0m throttling_burst_limit   = 100
          [32m+[0m[0m throttling_rate_limit    = 100
        }

      [32m+[0m[0m route_settings {
          [32m+[0m[0m data_trace_enabled       = false
          [32m+[0m[0m detailed_metrics_enabled = true
          [32m+[0m[0m logging_level            = (known after apply)
          [32m+[0m[0m route_key                = "GET /webhooks"
          [32m+[0m[0m throttling_burst_limit   = 40
          [32m+[0m[0m throttling_rate_limit    = 80
        }
      [32m+[0m[0m route_settings {
          [32m+[0m[0m data_trace_enabled       = false
          [32m+[0m[0m detailed_metrics_enabled = true
          [32m+[0m[0m logging_level            = (known after apply)
          [32m+[0m[0m route_key                = "GET /webhooks/{webhook_id}"
          [32m+[0m[0m throttling_burst_limit   = 40
          [32m+[0m[0m throttling_rate_limit    = 80
        }
      [32m+[0m[0m route_settings {
          [32m+[0m[0m data_trace_enabled       = false
          [32m+[0m[0m detailed_metrics_enabled = true
          [32m+[0m[0m logging_level            = (known after apply)
          [32m+[0m[0m route_key                = "POST /trigger-webhook/{webhook_id}"
          [32m+[0m[0m throttling_burst_limit   = 40
          [32m+[0m[0m throttling_rate_limit    = 80
        }
      [32m+[0m[0m route_settings {
          [32m+[0m[0m data_trace_enabled       = false
          [32m+[0m[0m detailed_metrics_enabled = true
          [32m+[0m[0m logging_level            = (known after apply)
          [32m+[0m[0m route_key                = "POST /webhook"
          [32m+[0m[0m throttling_burst_limit   = 40
          [32m+[0m[0m throttling_rate_limit    = 80
        }
    }

[1m  # module.api_gateway.aws_cloudwatch_log_group.this["this"][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "this" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/apigateway/preview-webhook_service/preview"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 7
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Service" = "webhook_service"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.get_webhook_docker_image.aws_ecr_lifecycle_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m rules = [
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Keep only the last 10 images"
                      [32m+[0m[0m rulePriority = 1
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber = 10
                          [32m+[0m[0m countType   = "imageCountMoreThan"
                          [32m+[0m[0m tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = (known after apply)
    }

[1m  # module.get_webhook_docker_image.aws_ecr_repository.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository" "this" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m force_delete         = true
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m image_tag_mutability = "MUTABLE"
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m registry_id          = (known after apply)
      [32m+[0m[0m repository_url       = (known after apply)
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m image_scanning_configuration {
          [32m+[0m[0m scan_on_push = false
        }
    }

[1m  # module.get_webhook_docker_image.docker_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_image" "this" {
      [32m+[0m[0m force_remove = false
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m image_id     = (known after apply)
      [32m+[0m[0m keep_locally = false
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m repo_digest  = (known after apply)
      [32m+[0m[0m triggers     = {
          [32m+[0m[0m "dir_sha" = "556cbb59d5718652d3c463571b354f634ef3f42c"
        }

      [32m+[0m[0m build {
          [32m+[0m[0m cache_from     = []
          [32m+[0m[0m context        = "./../get_webhook/"
          [32m+[0m[0m dockerfile     = "Dockerfile"
          [32m+[0m[0m extra_hosts    = []
          [32m+[0m[0m remove         = true
          [32m+[0m[0m security_opt   = []
          [32m+[0m[0m tag            = []
            [90m# (11 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.get_webhook_docker_image.docker_registry_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_registry_image" "this" {
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m insecure_skip_verify = false
      [32m+[0m[0m keep_remotely        = true
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m sha256_digest        = (known after apply)
      [32m+[0m[0m triggers             = {
          [32m+[0m[0m "dir_sha" = "556cbb59d5718652d3c463571b354f634ef3f42c"
        }
    }

[1m  # module.get_webhook_lambda.data.aws_iam_policy_document.logs[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = (known after apply)
        }
    }

[1m  # module.get_webhook_lambda.aws_cloudwatch_log_group.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = (known after apply)
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.get_webhook_lambda.aws_iam_policy.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "additional_inline" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "dynamodb:UpdateItem",
                          [32m+[0m[0m "dynamodb:Scan",
                          [32m+[0m[0m "dynamodb:Query",
                          [32m+[0m[0m "dynamodb:PutItem",
                          [32m+[0m[0m "dynamodb:GetItem",
                          [32m+[0m[0m "dynamodb:DeleteItem",
                          [32m+[0m[0m "dynamodb:BatchWriteItem",
                          [32m+[0m[0m "dynamodb:BatchGetItem",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "arn:aws:dynamodb:us-west-1:070576557102:table/webhook"
                      [32m+[0m[0m Sid      = "dynamodbcrud"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.get_webhook_lambda.aws_iam_policy.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.get_webhook_lambda.aws_iam_role.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # module.get_webhook_lambda.aws_iam_role_policy_attachment.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional_inline" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.get_webhook_lambda.aws_iam_role_policy_attachment.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.get_webhook_lambda.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = [
          [32m+[0m[0m "x86_64",
        ]
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m description                    = "AWS Educate TPET webhook-service in preview: GET /webhook/{webhook_id} "
      [32m+[0m[0m function_name                  = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m image_uri                      = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Image"
      [32m+[0m[0m publish                        = true
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = (known after apply)
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Prewarm"               = "true"
          [32m+[0m[0m "Service"               = "webhook_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Prewarm"               = "true"
          [32m+[0m[0m "Project"               = "AWS Educate TPET"
          [32m+[0m[0m "Service"               = "webhook_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m timeout                        = 30
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "DYNAMODB_TABLE" = "webhook"
              [32m+[0m[0m "ENVIRONMENT"    = "preview"
              [32m+[0m[0m "SERVICE"        = "webhook_service"
            }
        }

      [32m+[0m[0m ephemeral_storage {
          [32m+[0m[0m size = 512
        }

      [32m+[0m[0m logging_config {
          [32m+[0m[0m log_format = "Text"
          [32m+[0m[0m log_group  = (known after apply)
        }

      [32m+[0m[0m tracing_config (known after apply)
    }

[1m  # module.get_webhook_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "current_version_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m qualifier           = (known after apply)
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.get_webhook_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.list_webhooks_docker_image.aws_ecr_lifecycle_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m rules = [
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Keep only the last 10 images"
                      [32m+[0m[0m rulePriority = 1
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber = 10
                          [32m+[0m[0m countType   = "imageCountMoreThan"
                          [32m+[0m[0m tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = (known after apply)
    }

[1m  # module.list_webhooks_docker_image.aws_ecr_repository.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository" "this" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m force_delete         = true
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m image_tag_mutability = "MUTABLE"
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m registry_id          = (known after apply)
      [32m+[0m[0m repository_url       = (known after apply)
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m image_scanning_configuration {
          [32m+[0m[0m scan_on_push = false
        }
    }

[1m  # module.list_webhooks_docker_image.docker_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_image" "this" {
      [32m+[0m[0m force_remove = false
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m image_id     = (known after apply)
      [32m+[0m[0m keep_locally = false
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m repo_digest  = (known after apply)
      [32m+[0m[0m triggers     = {
          [32m+[0m[0m "dir_sha" = "556cbb59d5718652d3c463571b354f634ef3f42c"
        }

      [32m+[0m[0m build {
          [32m+[0m[0m cache_from     = []
          [32m+[0m[0m context        = "./../list_webhooks/"
          [32m+[0m[0m dockerfile     = "Dockerfile"
          [32m+[0m[0m extra_hosts    = []
          [32m+[0m[0m remove         = true
          [32m+[0m[0m security_opt   = []
          [32m+[0m[0m tag            = []
            [90m# (11 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.list_webhooks_docker_image.docker_registry_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_registry_image" "this" {
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m insecure_skip_verify = false
      [32m+[0m[0m keep_remotely        = true
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m sha256_digest        = (known after apply)
      [32m+[0m[0m triggers             = {
          [32m+[0m[0m "dir_sha" = "556cbb59d5718652d3c463571b354f634ef3f42c"
        }
    }

[1m  # module.list_webhooks_lambda.data.aws_iam_policy_document.logs[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = (known after apply)
        }
    }

[1m  # module.list_webhooks_lambda.aws_cloudwatch_log_group.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = (known after apply)
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.list_webhooks_lambda.aws_iam_policy.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "additional_inline" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "dynamodb:UpdateItem",
                          [32m+[0m[0m "dynamodb:Scan",
                          [32m+[0m[0m "dynamodb:Query",
                          [32m+[0m[0m "dynamodb:PutItem",
                          [32m+[0m[0m "dynamodb:GetItem",
                          [32m+[0m[0m "dynamodb:DeleteItem",
                          [32m+[0m[0m "dynamodb:BatchWriteItem",
                          [32m+[0m[0m "dynamodb:BatchGetItem",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = [
                          [32m+[0m[0m "arn:aws:dynamodb:us-west-1:070576557102:table/webhook_total_count",
                          [32m+[0m[0m "arn:aws:dynamodb:us-west-1:070576557102:table/webhook/index/webhook-webhook_type-sequence_number-gsi",
                          [32m+[0m[0m "arn:aws:dynamodb:us-west-1:070576557102:table/webhook",
                        ]
                      [32m+[0m[0m Sid      = "dynamodbcrud"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.list_webhooks_lambda.aws_iam_policy.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.list_webhooks_lambda.aws_iam_role.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # module.list_webhooks_lambda.aws_iam_role_policy_attachment.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional_inline" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.list_webhooks_lambda.aws_iam_role_policy_attachment.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.list_webhooks_lambda.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = [
          [32m+[0m[0m "x86_64",
        ]
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m description                    = "AWS Educate TPET webhook-service in preview: GET /webhooks"
      [32m+[0m[0m function_name                  = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m image_uri                      = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Image"
      [32m+[0m[0m publish                        = true
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = (known after apply)
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Service"               = "webhook_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Project"               = "AWS Educate TPET"
          [32m+[0m[0m "Service"               = "webhook_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m timeout                        = 30
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "DYNAMODB_TABLE"             = "webhook"
              [32m+[0m[0m "DYNAMODB_TABLE_TOTAL_COUNT" = "webhook_total_count"
              [32m+[0m[0m "ENVIRONMENT"                = "preview"
              [32m+[0m[0m "SERVICE"                    = "webhook_service"
            }
        }

      [32m+[0m[0m ephemeral_storage {
          [32m+[0m[0m size = 512
        }

      [32m+[0m[0m logging_config {
          [32m+[0m[0m log_format = "Text"
          [32m+[0m[0m log_group  = (known after apply)
        }

      [32m+[0m[0m tracing_config (known after apply)
    }

[1m  # module.list_webhooks_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "current_version_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m qualifier           = (known after apply)
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.list_webhooks_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.save_webhook_docker_image.aws_ecr_lifecycle_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m rules = [
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Keep only the last 10 images"
                      [32m+[0m[0m rulePriority = 1
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber = 10
                          [32m+[0m[0m countType   = "imageCountMoreThan"
                          [32m+[0m[0m tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = (known after apply)
    }

[1m  # module.save_webhook_docker_image.aws_ecr_repository.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository" "this" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m force_delete         = true
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m image_tag_mutability = "MUTABLE"
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m registry_id          = (known after apply)
      [32m+[0m[0m repository_url       = (known after apply)
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m image_scanning_configuration {
          [32m+[0m[0m scan_on_push = false
        }
    }

[1m  # module.save_webhook_docker_image.docker_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_image" "this" {
      [32m+[0m[0m force_remove = false
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m image_id     = (known after apply)
      [32m+[0m[0m keep_locally = false
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m repo_digest  = (known after apply)
      [32m+[0m[0m triggers     = {
          [32m+[0m[0m "dir_sha" = "556cbb59d5718652d3c463571b354f634ef3f42c"
        }

      [32m+[0m[0m build {
          [32m+[0m[0m cache_from     = []
          [32m+[0m[0m context        = "./../save_webhook/"
          [32m+[0m[0m dockerfile     = "Dockerfile"
          [32m+[0m[0m extra_hosts    = []
          [32m+[0m[0m remove         = true
          [32m+[0m[0m security_opt   = []
          [32m+[0m[0m tag            = []
            [90m# (11 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.save_webhook_docker_image.docker_registry_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_registry_image" "this" {
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m insecure_skip_verify = false
      [32m+[0m[0m keep_remotely        = true
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m sha256_digest        = (known after apply)
      [32m+[0m[0m triggers             = {
          [32m+[0m[0m "dir_sha" = "556cbb59d5718652d3c463571b354f634ef3f42c"
        }
    }

[1m  # module.save_webhook_lambda.data.aws_iam_policy_document.logs[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = (known after apply)
        }
    }

[1m  # module.save_webhook_lambda.aws_cloudwatch_log_group.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = (known after apply)
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.save_webhook_lambda.aws_iam_policy.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "additional_inline" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "dynamodb:UpdateItem",
                          [32m+[0m[0m "dynamodb:Scan",
                          [32m+[0m[0m "dynamodb:Query",
                          [32m+[0m[0m "dynamodb:PutItem",
                          [32m+[0m[0m "dynamodb:GetItem",
                          [32m+[0m[0m "dynamodb:DeleteItem",
                          [32m+[0m[0m "dynamodb:BatchWriteItem",
                          [32m+[0m[0m "dynamodb:BatchGetItem",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = [
                          [32m+[0m[0m "arn:aws:dynamodb:us-west-1:070576557102:table/webhook_total_count",
                          [32m+[0m[0m "arn:aws:dynamodb:us-west-1:070576557102:table/webhook",
                        ]
                      [32m+[0m[0m Sid      = "dynamodbcrud"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.save_webhook_lambda.aws_iam_policy.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.save_webhook_lambda.aws_iam_role.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # module.save_webhook_lambda.aws_iam_role_policy_attachment.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional_inline" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.save_webhook_lambda.aws_iam_role_policy_attachment.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.save_webhook_lambda.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = [
          [32m+[0m[0m "x86_64",
        ]
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m description                    = "AWS Educate TPET webhook-service in preview: POST /webhook"
      [32m+[0m[0m function_name                  = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m image_uri                      = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Image"
      [32m+[0m[0m publish                        = true
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = (known after apply)
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Prewarm"               = "true"
          [32m+[0m[0m "Service"               = "webhook_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Prewarm"               = "true"
          [32m+[0m[0m "Project"               = "AWS Educate TPET"
          [32m+[0m[0m "Service"               = "webhook_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m timeout                        = 30
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "DYNAMODB_TABLE"               = "webhook"
              [32m+[0m[0m "DYNAMODB_TABLE_TOTAL_COUNT"   = "webhook_total_count"
              [32m+[0m[0m "ENVIRONMENT"                  = "preview"
              [32m+[0m[0m "SERVICE"                      = "webhook_service"
              [32m+[0m[0m "TRIGGER_WEBHOOK_API_ENDPOINT" = "https://api.tpet.aws-educate.tw/preview/trigger-webhook"
            }
        }

      [32m+[0m[0m ephemeral_storage {
          [32m+[0m[0m size = 512
        }

      [32m+[0m[0m logging_config {
          [32m+[0m[0m log_format = "Text"
          [32m+[0m[0m log_group  = (known after apply)
        }

      [32m+[0m[0m tracing_config (known after apply)
    }

[1m  # module.save_webhook_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "current_version_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m qualifier           = (known after apply)
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.save_webhook_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.trigger_webhook_docker_image.aws_ecr_lifecycle_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m rules = [
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Keep only the last 10 images"
                      [32m+[0m[0m rulePriority = 1
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber = 10
                          [32m+[0m[0m countType   = "imageCountMoreThan"
                          [32m+[0m[0m tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = (known after apply)
    }

[1m  # module.trigger_webhook_docker_image.aws_ecr_repository.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository" "this" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m force_delete         = true
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m image_tag_mutability = "MUTABLE"
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m registry_id          = (known after apply)
      [32m+[0m[0m repository_url       = (known after apply)
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m image_scanning_configuration {
          [32m+[0m[0m scan_on_push = false
        }
    }

[1m  # module.trigger_webhook_docker_image.docker_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_image" "this" {
      [32m+[0m[0m force_remove = false
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m image_id     = (known after apply)
      [32m+[0m[0m keep_locally = false
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m repo_digest  = (known after apply)
      [32m+[0m[0m triggers     = {
          [32m+[0m[0m "dir_sha" = "556cbb59d5718652d3c463571b354f634ef3f42c"
        }

      [32m+[0m[0m build {
          [32m+[0m[0m cache_from     = []
          [32m+[0m[0m context        = "./../trigger_webhook/"
          [32m+[0m[0m dockerfile     = "Dockerfile"
          [32m+[0m[0m extra_hosts    = []
          [32m+[0m[0m remove         = true
          [32m+[0m[0m security_opt   = []
          [32m+[0m[0m tag            = []
            [90m# (11 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.trigger_webhook_docker_image.docker_registry_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_registry_image" "this" {
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m insecure_skip_verify = false
      [32m+[0m[0m keep_remotely        = true
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m sha256_digest        = (known after apply)
      [32m+[0m[0m triggers             = {
          [32m+[0m[0m "dir_sha" = "556cbb59d5718652d3c463571b354f634ef3f42c"
        }
    }

[1m  # module.trigger_webhook_lambda.data.aws_iam_policy_document.logs[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = (known after apply)
        }
    }

[1m  # module.trigger_webhook_lambda.aws_cloudwatch_log_group.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = (known after apply)
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.trigger_webhook_lambda.aws_iam_policy.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "additional_inline" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "dynamodb:UpdateItem",
                          [32m+[0m[0m "dynamodb:Scan",
                          [32m+[0m[0m "dynamodb:Query",
                          [32m+[0m[0m "dynamodb:PutItem",
                          [32m+[0m[0m "dynamodb:GetItem",
                          [32m+[0m[0m "dynamodb:DeleteItem",
                          [32m+[0m[0m "dynamodb:BatchWriteItem",
                          [32m+[0m[0m "dynamodb:BatchGetItem",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "arn:aws:dynamodb:us-west-1:070576557102:table/webhook"
                      [32m+[0m[0m Sid      = "dynamodbcrud"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = "secretsmanager:GetSecretValue"
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "arn:aws:secretsmanager:us-west-1:070576557102:secret:aws-educate-tpet/preview/service-accounts/*/access-token-*"
                      [32m+[0m[0m Sid      = "secretsmanager"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.trigger_webhook_lambda.aws_iam_policy.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.trigger_webhook_lambda.aws_iam_role.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Prewarm"     = "true"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "webhook_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # module.trigger_webhook_lambda.aws_iam_role_policy_attachment.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional_inline" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.trigger_webhook_lambda.aws_iam_role_policy_attachment.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.trigger_webhook_lambda.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = [
          [32m+[0m[0m "x86_64",
        ]
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m description                    = "AWS Educate TPET webhook-service in preview: POST /trigger-webhook/{webhook_id}"
      [32m+[0m[0m function_name                  = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m image_uri                      = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Image"
      [32m+[0m[0m publish                        = true
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = (known after apply)
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Prewarm"               = "true"
          [32m+[0m[0m "Service"               = "webhook_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Prewarm"               = "true"
          [32m+[0m[0m "Project"               = "AWS Educate TPET"
          [32m+[0m[0m "Service"               = "webhook_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m timeout                        = 30
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "DYNAMODB_TABLE"          = "webhook"
              [32m+[0m[0m "ENVIRONMENT"             = "preview"
              [32m+[0m[0m "SEND_EMAIL_API_ENDPOINT" = "https://api.tpet.aws-educate.tw/preview/send-email"
              [32m+[0m[0m "SERVICE"                 = "webhook_service"
            }
        }

      [32m+[0m[0m ephemeral_storage {
          [32m+[0m[0m size = 512
        }

      [32m+[0m[0m logging_config {
          [32m+[0m[0m log_format = "Text"
          [32m+[0m[0m log_group  = (known after apply)
        }

      [32m+[0m[0m tracing_config (known after apply)
    }

[1m  # module.trigger_webhook_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "current_version_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m qualifier           = (known after apply)
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.trigger_webhook_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1mPlan:[0m 70 to add, 0 to change, 0 to destroy.
[0m[0m[1mrandom_string.this: Creating...[0m[0m
[0m[1mrandom_string.this: Creation complete after 0s [id=0nv5][0m
[0m[1mmodule.get_webhook_lambda.aws_cloudwatch_log_group.lambda[0]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_cloudwatch_log_group.lambda[0]: Creating...[0m[0m
[0m[1mmodule.save_webhook_lambda.aws_iam_role.lambda[0]: Creating...[0m[0m
[0m[1mmodule.get_webhook_lambda.aws_iam_role.lambda[0]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_lambda.aws_cloudwatch_log_group.lambda[0]: Creating...[0m[0m
[0m[1maws_dynamodb_table.webhook: Creating...[0m[0m
[0m[1mmodule.save_webhook_docker_image.aws_ecr_repository.this[0]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_api.this[0]: Creating...[0m[0m
[0m[1maws_dynamodb_table.webhook_total_count: Creating...[0m[0m
[0m[1mmodule.get_webhook_lambda.aws_iam_role.lambda[0]: Creation complete after 0s [id=preview-webhook_service-get_webhook-0nv5][0m
[0m[1mmodule.get_webhook_docker_image.aws_ecr_repository.this[0]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_docker_image.aws_ecr_repository.this[0]: Creating...[0m[0m
[0m[1mmodule.save_webhook_lambda.aws_iam_role.lambda[0]: Creation complete after 0s [id=preview-webhook_service-save_webhook-0nv5][0m
[0m[1mmodule.save_webhook_lambda.aws_cloudwatch_log_group.lambda[0]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_cloudwatch_log_group.lambda[0]: Creation complete after 1s [id=/aws/lambda/preview-webhook_service-trigger_webhook-0nv5][0m
[0m[1mmodule.trigger_webhook_docker_image.aws_ecr_repository.this[0]: Creating...[0m[0m
[0m[1mmodule.get_webhook_lambda.aws_cloudwatch_log_group.lambda[0]: Creation complete after 1s [id=/aws/lambda/preview-webhook_service-get_webhook-0nv5][0m
[0m[1mmodule.api_gateway.aws_cloudwatch_log_group.this["this"]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_lambda.aws_cloudwatch_log_group.lambda[0]: Creation complete after 1s [id=/aws/lambda/preview-webhook_service-list_webhooks-0nv5][0m
[0m[1mmodule.save_webhook_lambda.aws_cloudwatch_log_group.lambda[0]: Creation complete after 1s [id=/aws/lambda/preview-webhook_service-save_webhook-0nv5][0m
[0m[1mmodule.save_webhook_docker_image.aws_ecr_repository.this[0]: Creation complete after 1s [id=preview-webhook_service-save_webhook-0nv5][0m
[0m[1mmodule.list_webhooks_lambda.aws_iam_role.lambda[0]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_iam_role.lambda[0]: Creating...[0m[0m
[0m[1mmodule.save_webhook_lambda.aws_iam_policy.additional_inline[0]: Creating...[0m[0m
[0m[1mmodule.get_webhook_docker_image.aws_ecr_repository.this[0]: Creation complete after 1s [id=preview-webhook_service-get_webhook-0nv5][0m
[0m[1mmodule.get_webhook_lambda.aws_iam_policy.additional_inline[0]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_docker_image.aws_ecr_repository.this[0]: Creation complete after 1s [id=preview-webhook_service-list_webhooks-0nv5][0m
[0m[1mmodule.trigger_webhook_lambda.aws_iam_policy.additional_inline[0]: Creating...[0m[0m
[0m[1mmodule.save_webhook_lambda.aws_iam_policy.additional_inline[0]: Creation complete after 0s [id=arn:aws:iam::070576557102:policy/preview-webhook_service-save_webhook-0nv5-inline][0m
[0m[1mmodule.list_webhooks_lambda.aws_iam_policy.additional_inline[0]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_iam_role.lambda[0]: Creation complete after 0s [id=preview-webhook_service-trigger_webhook-0nv5][0m
[0m[1mmodule.save_webhook_docker_image.aws_ecr_lifecycle_policy.this[0]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_cloudwatch_log_group.this["this"]: Creation complete after 0s [id=/aws/apigateway/preview-webhook_service/preview][0m
[0m[1mmodule.trigger_webhook_lambda.data.aws_iam_policy_document.logs[0]: Reading...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1291342927][0m
[0m[1mmodule.get_webhook_lambda.data.aws_iam_policy_document.logs[0]: Reading...[0m[0m
[0m[1mmodule.get_webhook_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4280291185][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_api.this[0]: Creation complete after 1s [id=7rheacyugd][0m
[0m[1mmodule.list_webhooks_lambda.data.aws_iam_policy_document.logs[0]: Reading...[0m[0m
[0m[1mmodule.list_webhooks_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2119185243][0m
[0m[1mmodule.save_webhook_lambda.data.aws_iam_policy_document.logs[0]: Reading...[0m[0m
[0m[1mmodule.save_webhook_docker_image.docker_image.this: Creating...[0m[0m
[0m[1mmodule.save_webhook_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2730605257][0m
[0m[1mmodule.trigger_webhook_docker_image.aws_ecr_repository.this[0]: Creation complete after 0s [id=preview-webhook_service-trigger_webhook-0nv5][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_domain_name.this[0]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_lambda.aws_iam_role.lambda[0]: Creation complete after 0s [id=preview-webhook_service-list_webhooks-0nv5][0m
[0m[1mmodule.save_webhook_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_iam_policy.logs[0]: Creating...[0m[0m
[0m[1mmodule.get_webhook_lambda.aws_iam_policy.additional_inline[0]: Creation complete after 0s [id=arn:aws:iam::070576557102:policy/preview-webhook_service-get_webhook-0nv5-inline][0m
[0m[1mmodule.get_webhook_lambda.aws_iam_policy.logs[0]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_lambda.aws_iam_policy.additional_inline[0]: Creation complete after 0s [id=arn:aws:iam::070576557102:policy/preview-webhook_service-list_webhooks-0nv5-inline][0m
[0m[1mmodule.get_webhook_docker_image.aws_ecr_lifecycle_policy.this[0]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_iam_policy.additional_inline[0]: Creation complete after 0s [id=arn:aws:iam::070576557102:policy/preview-webhook_service-trigger_webhook-0nv5-inline][0m
[0m[1mmodule.list_webhooks_docker_image.aws_ecr_lifecycle_policy.this[0]: Creating...[0m[0m
[0m[1mmodule.save_webhook_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Creation complete after 0s [id=preview-webhook_service-save_webhook-0nv5-20250105090612099700000001][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_authorizer.this["lambda_authorizer"]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_iam_policy.logs[0]: Creation complete after 0s [id=arn:aws:iam::070576557102:policy/preview-webhook_service-trigger_webhook-0nv5-logs][0m
[0m[1mmodule.list_webhooks_lambda.aws_iam_policy.logs[0]: Creating...[0m[0m
[0m[1mmodule.save_webhook_docker_image.aws_ecr_lifecycle_policy.this[0]: Creation complete after 0s [id=preview-webhook_service-save_webhook-0nv5][0m
[0m[1mmodule.get_webhook_docker_image.docker_image.this: Creating...[0m[0m
[0m[1mmodule.get_webhook_lambda.aws_iam_policy.logs[0]: Creation complete after 0s [id=arn:aws:iam::070576557102:policy/preview-webhook_service-get_webhook-0nv5-logs][0m
[0m[1mmodule.save_webhook_lambda.aws_iam_policy.logs[0]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_lambda.aws_iam_policy.logs[0]: Creation complete after 0s [id=arn:aws:iam::070576557102:policy/preview-webhook_service-list_webhooks-0nv5-logs][0m
[0m[1mmodule.list_webhooks_docker_image.docker_image.this: Creating...[0m[0m
[0m[1mmodule.get_webhook_docker_image.aws_ecr_lifecycle_policy.this[0]: Creation complete after 0s [id=preview-webhook_service-get_webhook-0nv5][0m
[0m[1mmodule.get_webhook_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_docker_image.aws_ecr_lifecycle_policy.this[0]: Creation complete after 0s [id=preview-webhook_service-list_webhooks-0nv5][0m
[0m[1mmodule.list_webhooks_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Creating...[0m[0m
[0m[1mmodule.save_webhook_lambda.aws_iam_policy.logs[0]: Creation complete after 0s [id=arn:aws:iam::070576557102:policy/preview-webhook_service-save_webhook-0nv5-logs][0m
[0m[1mmodule.trigger_webhook_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Creating...[0m[0m
[0m[1mmodule.get_webhook_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Creation complete after 0s [id=preview-webhook_service-get_webhook-0nv5-20250105090612415900000002][0m
[0m[1mmodule.trigger_webhook_docker_image.aws_ecr_lifecycle_policy.this[0]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Creation complete after 0s [id=preview-webhook_service-list_webhooks-0nv5-20250105090612448800000003][0m
[0m[1mmodule.trigger_webhook_lambda.aws_iam_role_policy_attachment.logs[0]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Creation complete after 0s [id=preview-webhook_service-trigger_webhook-0nv5-20250105090612469400000004][0m
[0m[1mmodule.get_webhook_lambda.aws_iam_role_policy_attachment.logs[0]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_iam_role_policy_attachment.logs[0]: Creation complete after 1s [id=preview-webhook_service-trigger_webhook-0nv5-20250105090612538300000005][0m
[0m[1mmodule.list_webhooks_lambda.aws_iam_role_policy_attachment.logs[0]: Creating...[0m[0m
[0m[1mmodule.get_webhook_lambda.aws_iam_role_policy_attachment.logs[0]: Creation complete after 1s [id=preview-webhook_service-get_webhook-0nv5-20250105090612546900000006][0m
[0m[1mmodule.trigger_webhook_docker_image.docker_image.this: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_authorizer.this["lambda_authorizer"]: Creation complete after 1s [id=yvujpe][0m
[0m[1mmodule.save_webhook_lambda.aws_iam_role_policy_attachment.logs[0]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_lambda.aws_iam_role_policy_attachment.logs[0]: Creation complete after 0s [id=preview-webhook_service-list_webhooks-0nv5-20250105090612634600000007][0m
[0m[1mmodule.trigger_webhook_docker_image.aws_ecr_lifecycle_policy.this[0]: Creation complete after 1s [id=preview-webhook_service-trigger_webhook-0nv5][0m
[0m[1mmodule.save_webhook_lambda.aws_iam_role_policy_attachment.logs[0]: Creation complete after 0s [id=preview-webhook_service-save_webhook-0nv5-20250105090612664300000008][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_domain_name.this[0]: Creation complete after 1s [id=preview-webhook-service-internal-api-tpet.aws-educate.tw][0m
[0m[1maws_route53_record.api_gateway_custom_domain_record: Creating...[0m[0m
[0m[1maws_dynamodb_table.webhook_total_count: Creation complete after 7s [id=webhook_total_count][0m
[0m[1maws_dynamodb_table.webhook: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.save_webhook_docker_image.docker_image.this: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.get_webhook_docker_image.docker_image.this: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.list_webhooks_docker_image.docker_image.this: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.trigger_webhook_docker_image.docker_image.this: Still creating... [10s elapsed][0m[0m
[0m[1maws_route53_record.api_gateway_custom_domain_record: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.get_webhook_docker_image.docker_image.this: Creation complete after 14s [id=sha256:ed86deedf88555ecd3e9f89100a8ce4dc0ffd3f7d0db39ebfdb9ed917db9aaa2070576557102.dkr.ecr.us-west-1.amazonaws.com/preview-webhook_service-get_webhook-0nv5][0m
[0m[1mmodule.list_webhooks_docker_image.docker_image.this: Creation complete after 14s [id=sha256:20b3987b672e03a53760a2c768f5cf9cb2dfe6ee84ae2e94d44968aaa03b3586070576557102.dkr.ecr.us-west-1.amazonaws.com/preview-webhook_service-list_webhooks-0nv5][0m
[0m[1mmodule.save_webhook_docker_image.docker_image.this: Creation complete after 14s [id=sha256:474470c7e1189f5b85281bc3071718d99c1e71c1d096166956a35c844529ea7e070576557102.dkr.ecr.us-west-1.amazonaws.com/preview-webhook_service-save_webhook-0nv5][0m
[0m[1mmodule.get_webhook_docker_image.docker_registry_image.this: Creating...[0m[0m
[0m[1mmodule.list_webhooks_docker_image.docker_registry_image.this: Creating...[0m[0m
[0m[1mmodule.save_webhook_docker_image.docker_registry_image.this: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_docker_image.docker_image.this: Creation complete after 14s [id=sha256:0377c6ad63fd1739f978adcefdb6ec892cc6943ed010292efc6eb2acdd1c596c070576557102.dkr.ecr.us-west-1.amazonaws.com/preview-webhook_service-trigger_webhook-0nv5][0m
[0m[1mmodule.trigger_webhook_docker_image.docker_registry_image.this: Creating...[0m[0m
[0m[1maws_dynamodb_table.webhook: Still creating... [20s elapsed][0m[0m
[0m[1maws_route53_record.api_gateway_custom_domain_record: Still creating... [20s elapsed][0m[0m
[0m[1maws_dynamodb_table.webhook: Creation complete after 24s [id=webhook][0m
[0m[1mmodule.get_webhook_docker_image.docker_registry_image.this: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.list_webhooks_docker_image.docker_registry_image.this: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.save_webhook_docker_image.docker_registry_image.this: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.trigger_webhook_docker_image.docker_registry_image.this: Still creating... [10s elapsed][0m[0m
[0m[1maws_route53_record.api_gateway_custom_domain_record: Still creating... [30s elapsed][0m[0m
[0m[1mmodule.get_webhook_docker_image.docker_registry_image.this: Still creating... [20s elapsed][0m[0m
[0m[1mmodule.list_webhooks_docker_image.docker_registry_image.this: Still creating... [20s elapsed][0m[0m
[0m[1mmodule.save_webhook_docker_image.docker_registry_image.this: Still creating... [20s elapsed][0m[0m
[0m[1mmodule.get_webhook_docker_image.docker_registry_image.this: Creation complete after 21s [id=sha256:46807ab1889f98154bd4b6366d6d1b5bbbbc9f9a0b8ab5a585c0a229c623eec3][0m
[0m[1mmodule.get_webhook_lambda.aws_lambda_function.this[0]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_docker_image.docker_registry_image.this: Still creating... [20s elapsed][0m[0m
[0m[1maws_route53_record.api_gateway_custom_domain_record: Still creating... [40s elapsed][0m[0m
[0m[1mmodule.save_webhook_docker_image.docker_registry_image.this: Creation complete after 28s [id=sha256:ce4eb3ab678bc52a2789fa4ddc7d191890e8683d9e2696aa3d246bff321e3616][0m
[0m[1mmodule.save_webhook_lambda.aws_lambda_function.this[0]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_docker_image.docker_registry_image.this: Still creating... [30s elapsed][0m[0m
[0m[1mmodule.get_webhook_lambda.aws_lambda_function.this[0]: Still creating... [10s elapsed][0m[0m
[0m[1maws_route53_record.api_gateway_custom_domain_record: Creation complete after 44s [id=Z07640481V8AX0BY9VGXY_preview-webhook-service-internal-api-tpet.aws-educate.tw_A][0m
[0m[1mmodule.trigger_webhook_docker_image.docker_registry_image.this: Still creating... [30s elapsed][0m[0m
[0m[1mmodule.save_webhook_lambda.aws_lambda_function.this[0]: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.list_webhooks_docker_image.docker_registry_image.this: Creation complete after 39s [id=sha256:21d08a713f5fd9cc6aa427dcc9508623470703056fcdd916070b1c5e354d4e56][0m
[0m[1mmodule.list_webhooks_lambda.aws_lambda_function.this[0]: Creating...[0m[0m
[0m[1mmodule.get_webhook_lambda.aws_lambda_function.this[0]: Creation complete after 20s [id=preview-webhook_service-get_webhook-0nv5][0m
[0m[1mmodule.get_webhook_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"]: Creating...[0m[0m
[0m[1mmodule.get_webhook_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Creating...[0m[0m
[0m[1mmodule.get_webhook_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"]: Creation complete after 0s [id=AllowExecutionFromAPIGateway20250105090706542300000009][0m
[0m[1mmodule.trigger_webhook_docker_image.docker_registry_image.this: Still creating... [40s elapsed][0m[0m
[0m[1mmodule.get_webhook_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Creation complete after 0s [id=AllowExecutionFromAPIGateway2025010509070654310000000a][0m
[0m[1mmodule.save_webhook_lambda.aws_lambda_function.this[0]: Creation complete after 13s [id=preview-webhook_service-save_webhook-0nv5][0m
[0m[1mmodule.save_webhook_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"]: Creating...[0m[0m
[0m[1mmodule.save_webhook_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Creating...[0m[0m
[0m[1mmodule.save_webhook_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"]: Creation complete after 1s [id=AllowExecutionFromAPIGateway2025010509070740300000000b][0m
[0m[1mmodule.save_webhook_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Creation complete after 1s [id=AllowExecutionFromAPIGateway2025010509070740370000000c][0m
[0m[1mmodule.trigger_webhook_docker_image.docker_registry_image.this: Creation complete after 45s [id=sha256:8990f00bc3111b63b1cd77e061e5a438977e636c25b125542f6ce6d47ee67d05][0m
[0m[1mmodule.trigger_webhook_lambda.aws_lambda_function.this[0]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_lambda.aws_lambda_function.this[0]: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_lambda_function.this[0]: Still creating... [10s elapsed][0m[0m
[0m[1mmodule.list_webhooks_lambda.aws_lambda_function.this[0]: Creation complete after 20s [id=preview-webhook_service-list_webhooks-0nv5][0m
[0m[1mmodule.list_webhooks_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Creating...[0m[0m
[0m[1mmodule.list_webhooks_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Creation complete after 0s [id=AllowExecutionFromAPIGateway2025010509072521970000000d][0m
[0m[1mmodule.list_webhooks_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"]: Creation complete after 1s [id=AllowExecutionFromAPIGateway2025010509072522010000000e][0m
[0m[1mmodule.trigger_webhook_lambda.aws_lambda_function.this[0]: Creation complete after 20s [id=preview-webhook_service-trigger_webhook-0nv5][0m
[0m[1mmodule.trigger_webhook_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["POST /trigger-webhook/{webhook_id}"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["GET /webhooks"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["GET /webhooks/{webhook_id}"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["POST /webhook"]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Creation complete after 0s [id=AllowExecutionFromAPIGateway2025010509073210300000000f][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["GET /webhooks"]: Creation complete after 0s [id=0ae1l7u][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["GET /webhooks/{webhook_id}"]: Creation complete after 0s [id=2ibqzol][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["POST /trigger-webhook/{webhook_id}"]: Creation complete after 0s [id=txk3r67][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_integration.this["POST /webhook"]: Creation complete after 0s [id=fy1kwfc][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["GET /webhooks/{webhook_id}"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["POST /trigger-webhook/{webhook_id}"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["POST /webhook"]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["GET /webhooks"]: Creating...[0m[0m
[0m[1mmodule.trigger_webhook_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"]: Creation complete after 1s [id=AllowExecutionFromAPIGateway20250105090732105600000010][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["POST /trigger-webhook/{webhook_id}"]: Creation complete after 1s [id=1kskahq][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["GET /webhooks/{webhook_id}"]: Creation complete after 1s [id=tsj20a0][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["GET /webhooks"]: Creation complete after 1s [id=7pc3kjg][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_route.this["POST /webhook"]: Creation complete after 1s [id=oyd2914][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_stage.this[0]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_stage.this[0]: Creation complete after 1s [id=preview][0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Creating...[0m[0m
[0m[1mmodule.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Creation complete after 1s [id=etmohd][0m
[0m[1m[32m
Apply complete! Resources: 70 added, 0 changed, 0 destroyed.
[0m
```

</details>

*Pushed by: @chungchihhan, Action: `pull_request`*